In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one  0.268435  0.931436
1    a  two -1.618310  0.222280
2    b  one -1.032465 -1.177937
3    b  two -1.719815  1.007438
4    a  one -1.081802 -1.107085

In [8]:
a=df['data1'].groupby(df['key1'])
a

In [9]:
b=df[['data2']].groupby(df['key1'])
b

In [15]:
type(df['data1'])

pandas.core.series.Series

In [20]:
type(df[['data1']])

pandas.core.frame.DataFrame

In [18]:
df['data1']

0    0.268435
1   -1.618310
2   -1.032465
3   -1.719815
4   -1.081802
Name: data1, dtype: float64

In [21]:
df[['data1']]

      data1
0  0.268435
1 -1.618310
2 -1.032465
3 -1.719815
4 -1.081802

In [23]:
people = pd.DataFrame(np.random.randn(5, 5),columns=['a', 'b', 'c', 'd', 'e'],index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [24]:
people.iloc[2:3, [1, 2]] = np.nan

In [25]:
people

               a         b         c         d         e
Joe    -0.879212  0.097081 -0.505999  1.125897  0.993028
Steve   0.017111 -0.361298 -1.183112 -0.609544  0.515934
Wes    -0.578182       NaN       NaN -0.201516 -0.788970
Jim    -0.483219 -0.603830 -0.682058  2.341653 -0.137216
Travis -0.918712  0.507801  1.211142  0.856555 -0.519084

In [30]:
kkk = [1,1,1,2,2]

In [34]:
by_column_1 = people.groupby(kkk, axis=1)

In [35]:
by_column_1.sum()

               1         2
Joe    -1.288130  2.118925
Steve  -1.527299 -0.093610
Wes    -0.578182 -0.990485
Jim    -1.769107  2.204438
Travis  0.800231  0.337471

In [33]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue','d': 'blue', 'e': 'red', 'f' : 'orange'}

In [36]:
by_column = people.groupby(mapping, axis=1)

In [37]:
by_column.sum()

            blue       red
Joe     0.619898  0.210897
Steve  -1.792656  0.171747
Wes    -0.201516 -1.367151
Jim     1.659595 -1.224265
Travis  2.067697 -0.929995

In [38]:
map_series = pd.Series(mapping)

In [39]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [40]:
map_series['a']

'red'

In [41]:
map_series[0]

'red'

In [42]:
map_series['a':'c']

a     red
b     red
c    blue
dtype: object

In [43]:
map_series[0:3]

a     red
b     red
c    blue
dtype: object

In [44]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [46]:
people.groupby(mapping, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3